#1. Напишите программу, которая приветствует пользователя,
# выводя слово `Hello`, введенное имя и знаки препинания по образцу:

print("Hello, " + input('What is you name: ') + "!")
